app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'POST') {
            $session = session();
            $model = new UserModel();

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'amit@gmail.com'
 LIMIT 1