app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `user_id` = '1'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
JOIN `tours` ON `tours`.`tour_id` = `bookings`.`tour_id`
WHERE `bookings`.`user_id` = '1'
AND `tours`.`departure_date` > '2025-08-08 05:45:55'
---
    public function profile(): string
    {
        $session = session();
        $userId = $session->get('user_id');
        $usermodel = new UserModel();
        $user = $usermodel->where('user_id', $userId)->first();

        $bookingModel = new BookingModel();
        $totalBooking = $bookingModel->where('user_id', $userId)->countAllResults();
        $upcommingBooking = $bookingModel->join('tours', 'tours.tour_id = bookings.tour_id')
            ->where('bookings.user_id', $userId)
            ->where('tours.departure_date >', date('Y-m-d H:i:s'))
            ->countAllResults();