app/Controllers/TourController.php

    public function index()
    {
        $model = new TourModel();
        $data['tours'] = $model->findAll();
---
SELECT *
FROM `tours`