app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();  // Optional: use only verified users

SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'
---
    public function updateProfile()
    {
        $model = new UserModel();
        $userId = session()->get('user_id');

        // Handle GET request (show form)
        if ($this->request->is('get')) {
            $data['user'] = $model->find($userId);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
UPDATE `users` SET `role` = 'admin'
WHERE `users`.`user_id` IN ('2')
---
    public function changeUserRole($user_id)
    {
        if (session()->get('role') != 'admin') {
            return redirect()->back()->with('error', 'You are not authorized to perform this action.');
        }
        if(session('user_id') == $user_id) {
            return redirect()->back()->with('error', 'You cannot change your own role.');
        }
        $usermodel = new UserModel();
        $role = $this->request->getPost('role');

        $user = $usermodel->find($user_id);
        if ($user) {
            $usermodel->update($user_id, ['role' => $role]);