app/Models/BookingModel.php

SELECT `bookings`.*, `tours`.`image`, `tours`.`title`, `tours`.`from_location`, `tours`.`to_location`, `tours`.`departure_date`, `tours`.`return_date`, `tours`.`price_per_person`
FROM `bookings`
JOIN `tours` ON `tours`.`tour_id` = `bookings`.`tour_id`
WHERE `bookings`.`user_id` = '2'
---
    public function getUserBookings($userId)
    {
        return $this->select('bookings.*, tours.image, tours.title, tours.from_location, tours.to_location, tours.departure_date, tours.return_date, tours.price_per_person')
            ->join('tours', 'tours.tour_id = bookings.tour_id')
            ->where('bookings.user_id', $userId)
            ->findAll();